content-org/all-posts.org
#+hugo_base_dir: ../
* DONE ELF
CLOSED: [2023-07-15]
:PROPERTIES:
:ID:       A3159F72-A4D6-4CBA-AD75-7F06181FC3D7
:EXPORT_FILE_NAME: elf
:EXPORT_HUGO_CUSTOM_FRONT_MATTER: :summary "In 1965, Ted Nelson theorized the Evolutionary List File and offered clear insights into the relationship between technology and creativity that are still relevant today."
:END:

** Introduction
   :PROPERTIES:
   :CUSTOM_ID: introduction
   :ID:       1092F0BE-C254-4309-96DF-9D2640644353
   :END:
I'm obsessed with information management. From my research on the
preservation of LGBTQ history in Louisville to my professional and
technical communication teaching that emphasizes tools and technologies
for increased knowledge management and efficiency, I've always been
fascinated by how information management techniques can make life more,
well, manageable. Even my love of Hugo, branded as "a content manager's
dream," reflects this passion.

Information management--here broadly including content
management/strategy, knowledge management, and personal knowledge
management--is often seen as a mundane task that simply sets the stage
for the creative process. To me, though, organizing information is
nine-tenths of the creative process itself. The decisions we make as we
manage the information we come into contact with /are/ the creative
process. "Inspiration" is, really, just a word we came up with to label
their effect.

Serendipity exists, of course. But serendipity has more to do with
creatively setting the conditions for discovery than with the
mythological moment of "eureka." There have been several methods,
processes, and tools offered to set these conditions. One of the most
interesting ones, though, is Nelson's imagined "ELF" system.

** The Evolutionary List File
   :PROPERTIES:
   :CUSTOM_ID: the-evolutionary-list-file
   :ID:       2C2A58F1-A0E0-46E1-BCB0-A53FEB79A2D2
   :END:
In 1965, Ted Nelson published a paper titled "A File Structure for the
Complex, the Changing, and the Indeterminate." Beyond coining the word
"hypertext," this paper theorized a system for information management
that Nelson called an Evolutionary List File (ELF). Nelson found
computer programs at the time to underemphasize the iterative and
inventive phases of thinking and writing (136b) and proposed the ELF, "a
file structure that can be shaped into various forms, changed from one
arrangement to another in accordance with the user's changing need"
(137b), as a hypothetical alternative.

At root, the ELF would be a bundle of nested lists, where information
could be quickly stored and accessed. While it was writing-oriented, it
was *not* an outlining system in the way that many list-based writing
tools were and still are today. Instead of creating a hierarchical
outline, an ELF user would iteratively link items together to form new
connections over time (138a). Rather than sorting information into
discrete folders, as we still mainly do today, we would focus instead on
creating connections.

The effects of this system, described by Nelson, would include:

- Affording an ongoing "conversation" between entries, with users
  reviewing content and considering them in new ways.
- Creating an emergent, rhizomatic structure for entries and
  discouraging "fixed," hierarchical thinking.
- Reflecting the patterns of human thought instead of asking users to
  "think" like a computer in their creative processes.

*** ELF and Creativity
    :PROPERTIES:
    :CUSTOM_ID: elf-and-creativity
    :ID:       2E56B058-3CA6-4CBE-A8EE-FF784CC587D4
    :END:
I find Nelson's structure interesting because it offers such clear
insights into the relationship between technology and creativity that
are still relevant today.

Nelson believed that any storage or writing system that creates friction
with *change and iteration* is fundamentally at odds with creative
practice. He wrote:

#+begin_quote
  Human ideas, science, scholarship, and language are constantly
  collapsing and unfolding. Any field, and the corpus of all fields, is
  a bundle of relationships subject to all kinds of twists, inversions,
  involutions, and rearrangement: these changes are frequent but
  unpredictable. . . . [P]erhaps here, as in biology, the only ultimate
  structure is change itself” (144a, 144b).
#+end_quote

For Nelson, any system of thinking that assumes "/true/ or /ideal/
or /permanent/ codes and categories" is at odds with human thinking and
creative practice. In other words. Categorization is provisional, which
should be reflected in our systems of thinking and writing (144b). The
ELF, though hypothetical at the time, was one way to embrace change in
information management.

** ELF's Value Today
   :PROPERTIES:
   :CUSTOM_ID: elfs-value-today
   :ID:       37DD7C69-1184-4810-AB23-F22F90405D40
   :END:
Today, the personal knowledge management movement (PKM) has called more
attention to the problems that Nelson described, sometimes uncannily so.
For example, the Zettelkasten method of note-taking, invented by Niklas
Luhmann and more recently popularized in the note-taking book /How to
Take Smart Notes/, seems almost identical to one comment about ELF made
by Nelson:

#+begin_quote
  By assigning entries to lists, the ELF may be used as a glorified card
  file, with separate lists used for categories, trails, etc. This
  permits extensive cross-indexing by the assignment of one entry into
  different lists. It permits subsets and sub-sequences for any use to
  be held apart and examined without disturbing the lists from which
  they have been drawn, by copying them onto other, new lists. (140a)
#+end_quote

So many of the new conversations in personal knowledge management, such
as Zettelkasten/Smart Notes and the PARA method, focus on the
limitations of file structures that Nelson was identifying in 1965 but
that are still reflected in many of our digital habits today.

Why does all this matter? Creating hierarchies and outlines of
information can be useful, but many don't realize that outlines have to
work on /existing/ material; they are not creative practices themselves
(Nelson 135b). This is why the common myth we tell ourselves and our
students that an outline should be worked on /before/ writing at best
makes little sense and at worst is cruel; how can we outline ideas we
haven't created yet?

** ELF in Practice
   :PROPERTIES:
   :CUSTOM_ID: elf-in-practice
   :ID:       6547B59D-C9A9-4E4F-A04C-5BD6C15F0925
   :END:
Luckily, within the last several years there have been many tools and
strategies that allow individuals to experiment with alternatives to
hierarchical information structures. For example, nearly all of my
creative activity makes use of the Zettelkasten method, with Obsidian
being the main tool. Rather than laying out my full method of
information management--which I surely will at some point--here are a
few resources and tools that have taken up the spirit of Nelson's paper.

*** Books, Articles, and Resources
    :PROPERTIES:
    :CUSTOM_ID: books-articles-and-resources
    :ID:       FEE37EF4-714B-4DDB-809E-29F5B0DE5FBC
    :END:
These books, articles, and resources offer ways of thinking about
organizing information in non-hierarchical, creative ways.

- /[[https://www.soenkeahrens.de/en/takesmartnotes][How to Take Smart
  Notes]]/ by Sönke Ahrens
- /[[https://www.buildingasecondbrain.com/][Building a Second Brain]]/
  by Tiago Forte
- "[[https://martinezponciano.es/2021/04/05/research-workflow-as-a-phd-student-in-the-humanities/][Research
  workflow as a PhD student in the Humanities]]" by Regina Martínez
  Ponciano
- [[https://zettelkasten.de/posts/overview/]["The Zettelkasten Method:
  Getting Started"]]

*** Tools and Technologies
    :PROPERTIES:
    :CUSTOM_ID: tools-and-technologies
    :ID:       532FDB72-EF98-4440-A6A1-58B54B83A4D2
    :END:
These tools and technologies include affordances for non-hierarchical
information management, such as
[[https://medium.com/tools-for-thought-the-ultimate-guide/using-backlinks-the-beginners-guide-to-skyrocket-your-note-taking-1b5ba57403][backlinking]].

- [[https://obsidian.md/][Obsidian]]
- [[https://roamresearch.com/][Roam Research]]
- [[https://www.notion.so/][Notion]]
- [[https://www.devontechnologies.com/apps/devonthink?pk_campaign=google&pk_kwd=devonthink1&gclid=CjwKCAjwh8mlBhB_EiwAsztdBOvZ7Bx8feUUJoWkgIUrQaqBd9lCfM7wDZmdGaPdCaDQzKuCHH8NIhoCMNUQAvD_BwE][DEVONThink]]

** Citation
   :PROPERTIES:
   :CUSTOM_ID: citation
   :ID:       EF954548-9234-4F3C-9458-68B0225869E6
   :END:
Nelson, Theodore H. "A File Structure for the Complex, the Changing, and
the Indeterminate." /The New Media Reader/, edited by Noah Wardrip-Fruin
and Nick Montfort, MIT P, 2003, pp. 134--45.

