content/posts/elf.md
+++
title = "ELF"
author = ["Rick Wysocki"]
date = 2023-07-15T00:00:00-04:00
draft = false
summary = "Here is my post summary."
+++

## Introduction {#introduction}

I'm obsessed with information management. From my research on the
preservation of LGBTQ history in Louisville to my professional and
technical communication teaching that emphasizes tools and technologies
for increased knowledge management and efficiency, I've always been
fascinated by how information management techniques can make life more,
well, manageable. Even my love of Hugo, branded as "a content manager's
dream," reflects this passion.

Information management--here broadly including content
management/strategy, knowledge management, and personal knowledge
management--is often seen as a mundane task that simply sets the stage
for the creative process. To me, though, organizing information is
nine-tenths of the creative process itself. The decisions we make as we
manage the information we come into contact with _are_ the creative
process. "Inspiration" is, really, just a word we came up with to label
their effect.

Serendipity exists, of course. But serendipity has more to do with
creatively setting the conditions for discovery than with the
mythological moment of "eureka." There have been several methods,
processes, and tools offered to set these conditions. One of the most
interesting ones, though, is Nelson's imagined "ELF" system.


## The Evolutionary List File {#the-evolutionary-list-file}

In 1965, Ted Nelson published a paper titled "A File Structure for the
Complex, the Changing, and the Indeterminate." Beyond coining the word
"hypertext," this paper theorized a system for information management
that Nelson called an Evolutionary List File (ELF). Nelson found
computer programs at the time to underemphasize the iterative and
inventive phases of thinking and writing (136b) and proposed the ELF, "a
file structure that can be shaped into various forms, changed from one
arrangement to another in accordance with the user's changing need"
(137b), as a hypothetical alternative.

At root, the ELF would be a bundle of nested lists, where information
could be quickly stored and accessed. While it was writing-oriented, it
was **not** an outlining system in the way that many list-based writing
tools were and still are today. Instead of creating a hierarchical
outline, an ELF user would iteratively link items together to form new
connections over time (138a). Rather than sorting information into
discrete folders, as we still mainly do today, we would focus instead on
creating connections.

The effects of this system, described by Nelson, would include:

-   Affording an ongoing "conversation" between entries, with users
    reviewing content and considering them in new ways.
-   Creating an emergent, rhizomatic structure for entries and
    discouraging "fixed," hierarchical thinking.
-   Reflecting the patterns of human thought instead of asking users to
    "think" like a computer in their creative processes.


### ELF and Creativity {#elf-and-creativity}

I find Nelson's structure interesting because it offers such clear
insights into the relationship between technology and creativity that
are still relevant today.

Nelson believed that any storage or writing system that creates friction
with **change and iteration** is fundamentally at odds with creative
practice. He wrote:

> Human ideas, science, scholarship, and language are constantly
> collapsing and unfolding. Any field, and the corpus of all fields, is
> a bundle of relationships subject to all kinds of twists, inversions,
> involutions, and rearrangement: these changes are frequent but
> unpredictable. . . . [P]erhaps here, as in biology, the only ultimate
> structure is change itself” (144a, 144b).

For Nelson, any system of thinking that assumes "_true_ or _ideal_
or _permanent_ codes and categories" is at odds with human thinking and
creative practice. In other words. Categorization is provisional, which
should be reflected in our systems of thinking and writing (144b). The
ELF, though hypothetical at the time, was one way to embrace change in
information management.


## ELF's Value Today {#elfs-value-today}

Today, the personal knowledge management movement (PKM) has called more
attention to the problems that Nelson described, sometimes uncannily so.
For example, the Zettelkasten method of note-taking, invented by Niklas
Luhmann and more recently popularized in the note-taking book _How to
Take Smart Notes_, seems almost identical to one comment about ELF made
by Nelson:

> By assigning entries to lists, the ELF may be used as a glorified card
> file, with separate lists used for categories, trails, etc. This
> permits extensive cross-indexing by the assignment of one entry into
> different lists. It permits subsets and sub-sequences for any use to
> be held apart and examined without disturbing the lists from which
> they have been drawn, by copying them onto other, new lists. (140a)

So many of the new conversations in personal knowledge management, such
as Zettelkasten/Smart Notes and the PARA method, focus on the
limitations of file structures that Nelson was identifying in 1965 but
that are still reflected in many of our digital habits today.

Why does all this matter? Creating hierarchies and outlines of
information can be useful, but many don't realize that outlines have to
work on _existing_ material; they are not creative practices themselves
(Nelson 135b). This is why the common myth we tell ourselves and our
students that an outline should be worked on _before_ writing at best
makes little sense and at worst is cruel; how can we outline ideas we
haven't created yet?


## ELF in Practice {#elf-in-practice}

Luckily, within the last several years there have been many tools and
strategies that allow individuals to experiment with alternatives to
hierarchical information structures. For example, nearly all of my
creative activity makes use of the Zettelkasten method, with Obsidian
being the main tool. Rather than laying out my full method of
information management--which I surely will at some point--here are a
few resources and tools that have taken up the spirit of Nelson's paper.


### Books, Articles, and Resources {#books-articles-and-resources}

These books, articles, and resources offer ways of thinking about
organizing information in non-hierarchical, creative ways.

-   _[How to Take Smart
    Notes](https://www.soenkeahrens.de/en/takesmartnotes)_ by Sönke Ahrens
-   _[Building a Second Brain](https://www.buildingasecondbrain.com/)_
    by Tiago Forte
-   "[Research
    workflow as a PhD student in the Humanities](https://martinezponciano.es/2021/04/05/research-workflow-as-a-phd-student-in-the-humanities/)" by Regina Martínez
    Ponciano
-   ["The Zettelkasten Method:
    Getting Started"](https://zettelkasten.de/posts/overview/)


### Tools and Technologies {#tools-and-technologies}

These tools and technologies include affordances for non-hierarchical
information management, such as
[backlinking](https://medium.com/tools-for-thought-the-ultimate-guide/using-backlinks-the-beginners-guide-to-skyrocket-your-note-taking-1b5ba57403).

-   [Obsidian](https://obsidian.md/)
-   [Roam Research](https://roamresearch.com/)
-   [Notion](https://www.notion.so/)
-   [DEVONThink](https://www.devontechnologies.com/apps/devonthink?pk_campaign=google&pk_kwd=devonthink1&gclid=CjwKCAjwh8mlBhB_EiwAsztdBOvZ7Bx8feUUJoWkgIUrQaqBd9lCfM7wDZmdGaPdCaDQzKuCHH8NIhoCMNUQAvD_BwE)


## Citation {#citation}

Nelson, Theodore H. "A File Structure for the Complex, the Changing, and
the Indeterminate." _The New Media Reader_, edited by Noah Wardrip-Fruin
and Nick Montfort, MIT P, 2003, pp. 134--45.
